Tekla Open API Reference for Tekla Structures 2025
DrawingObject.NoAttributes Constructor (String)
 Creates a new no attributes instance. No attributes are loaded from the attribute file as it is not possible to load attributes for objects of this type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NoAttributes(
	string AttributeFile
)
Public Sub New (
	AttributeFile As String
)
Parameters
AttributeFile
Type: System.String
The filename of the attribute file.
See Also
Reference
DrawingObject.NoAttributes Class
DrawingObject.NoAttributes Overload
Tekla.Structures.Drawing Namespace